import os
from dotenv import load_dotenv

load_dotenv()

TOKEN = os.getenv("MAIN_TOKEN")
# TOKEN = os.getenv("TEST_TOKEN") # test token

ADMIN_ID = os.getenv("ADMIN_ID")
BACK_UP_CHAT = os.getenv("BACK_UP_CHAT")


HEADERS = {'user-agent': 'my-app/0.0.1'}

LANGCODES = {
    "русский": "ru",
    "английский": "en",
    "французский": "fr",
    "немецкий": "de",
    "испанский": "es",
    "японский": "ja",
    "арабский": "ar",
    "итальянский": "it",
    "турецкий": "tr",
    "китайский": "zh-cn"
}

LEARNING_MODE = {
        1: "10:00 | 14:00 | 18:00",
        2: "10:00 | 13:00 | 16:00",
        3: "10:00 | 15:00 | 20:00"
}

ALLOWED_LANGS = {
    'русский': ['арабский', 'немецкий', 'английский', 'испанский', 'французский', 'итальянский', 'японский'],
    'английский': ['арабский', 'немецкий', 'испанский', 'французский', 'итальянский', 'японский', 'русский', 'турецкий', 'китайский'],
    'французский': ['английский', 'арабский', 'немецкий', 'испанский', 'итальянский', 'японский', 'русский', 'турецкий', 'китайский'],
    'немецкий': ['арабский', 'английский', 'испанский', 'французский', 'итальянский', 'японский', 'русский', 'турецкий'],
    'испанский': ['английский', 'арабский', 'немецкий', 'французский', 'итальянский', 'японский', 'русский', 'турецкий', 'китайский'],
    'японский': ['английский', 'немецкий', 'испанский', 'французский', 'итальянский', 'русский'],
    'арабский': ['немецкий', 'английский', 'испанский', 'французский', 'итальянский', 'русский', 'турецкий'],
    'итальянский': ['арабский', 'немецкий', 'английский', 'испанский', 'французский', 'итальянский', 'японский', 'русский', 'турецкий'],
    'турецкий': ['английский', 'испанский', 'французский', 'итальянский', 'арабский', 'немецкий'], 'китайский': ['английский', 'испанский', 'французский']
}

LANGS = ALLOWED_LANGS.keys()
# Template for code-split-comment
#---------------------------------------------------------------------------
#   SOME_TEXT
#---------------------------------------------------------------------------
# Aida - 865060504
